namespace Delegates_20241123_task2
{
//    Создайте и заполните массив на 30 элементов.
//Создайте 4 метода, которые принимают массив и выполняют: 

//1) Сортировка и вывод массива в по возрастанию.
//2) Сортировка и вывод массива в по убыванию.
//3) Создание и вывод массива только с четными значениями.
//4) Создание и вывод массива только с нечетными значениями.

//Создайте делегат, объекты делегата на каждый метод, после объедините все объекты делегата в один и отобразите операции на экран.
//Консольный вывод может выглядеть следующим образом:

//Исходный массив:
//2       -4      10      5       -6      9
//Отсортированный массив в большую сторону:
//-6      -4      2       5       9       10
//Четный массив:
//-6      -4      2       6       10      10
//Отсортированный массив в меньшую сторону:
//10      10      6       2       -4      -6
//Нечетный массив:
//11      11      7       3       -3      -5
    internal class Program
    {
        static void Main(string[] args)
        {
            Del del1 = AscSort;
            Del del2 = DescSort;
            Del del3 = EvenSort;
            Del del4 = UnevSort;

            Del del5 = del1 + del2 + del3 + del4;

            Console.WriteLine("Hello, World!");
        }

        public delegate int[] Del(int[] nums);

        //public static int[] AscSort(int[] nums)
        //{

        //}

        //public static int[] DescSort(int[] nums)
        //{

        //}

        //public static int[] EvenSort(int[] nums)
        //{

        //}

        //public static int[] UnevSort(int[] nums)
        //{

        //}
    }
}
